titanic dataset tutorial... Let's Go!

In [1]:
import pandas as pd

In [2]:
pd.__version__

'0.24.2'

In [2]:
titanic= pd.read_csv('titanic.csv')

In [3]:
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [4]:
pivot_titanic=titanic.pivot_table(index='pclass',columns='sex',aggfunc=len,values='survived')

In [5]:
pivot_titanic

sex     female  male
pclass
1          144   179
2          106   171
3          216   493

In [6]:
pivot_titanic['female'].sum()

466

In [7]:
pivot_titanic[['female','male']].sum()

sex
female    466
male      843
dtype: int64

In [9]:
from pivottablejs import pivot_ui
pivot_ui(titanic)

Adding an interactive widget

In [8]:
import numpy as np
from ipywidgets import interact
@interact
def jim (input = 'Good morning, jim!', times=[1,3,5]):
    return(input + ' ')*times

interactive(children=(Text(value='Good morning, jim!', description='input'), Dropdown(description='times', optâ€¦

In [9]:
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

### Converting index to a column and choosing a different column name

- Use <code>rename_axis</code> to set the index level name
- Then call <code>reset_index</code>
- Avoid the ugly <code>'index'</code>

In [10]:
female_survival=titanic[['sex','name','survived']].tail(5)

In [11]:
female_survival.head()

         sex                       name  survived
1304  female       Zabour, Miss. Hileni         0
1305  female      Zabour, Miss. Thamine         0
1306    male  Zakarian, Mr. Mapriededer         0
1307    male        Zakarian, Mr. Ortin         0
1308    male         Zimmerman, Mr. Leo         0

In [12]:
female_survival.reset_index()

   index     sex                       name  survived
0   1304  female       Zabour, Miss. Hileni         0
1   1305  female      Zabour, Miss. Thamine         0
2   1306    male  Zakarian, Mr. Mapriededer         0
3   1307    male        Zakarian, Mr. Ortin         0
4   1308    male         Zimmerman, Mr. Leo         0

In [13]:
female_survival.rename_axis('ID Number')

              sex                       name  survived
ID Number
1304       female       Zabour, Miss. Hileni         0
1305       female      Zabour, Miss. Thamine         0
1306         male  Zakarian, Mr. Mapriededer         0
1307         male        Zakarian, Mr. Ortin         0
1308         male         Zimmerman, Mr. Leo         0

In [14]:
female_survival.rename_axis('ID Number').reset_index()

   ID Number     sex                       name  survived
0       1304  female       Zabour, Miss. Hileni         0
1       1305  female      Zabour, Miss. Thamine         0
2       1306    male  Zakarian, Mr. Mapriededer         0
3       1307    male        Zakarian, Mr. Ortin         0
4       1308    male         Zimmerman, Mr. Leo         0

All I do is win